WHeiu/Drone-control-project/无人机管控模块/程序/stm32_new_HAL_LL/Stm32_New-1.1.2/Src/MPU9250/invmpuu.c
    if (i2c_read(st.hw->addr, 0x0D, 4, tmp))
        return 0x07;

    shift_code[0] = ((tmp[0] & 0xE0) >> 3) | ((tmp[3] & 0x30) >> 4);
    shift_code[1] = ((tmp[1] & 0xE0) >> 3) | ((tmp[3] & 0x0C) >> 2);
    shift_code[2] = ((tmp[2] & 0xE0) >> 3) | (tmp[3] & 0x03);
    for (ii = 0; ii < 3; ii++) {
        if (!shift_code[ii]) {
            st_shift[ii] = 0.f;
            continue;
        }
        /* Equivalent to..
         * st_shift[ii] = 0.34f * powf(0.92f/0.34f, (shift_code[ii]-1) / 30.f)
         */
        st_shift[ii] = 0.34f;
        while (--shift_code[ii])
            st_shift[ii] *= 1.034f;
    }
    return 0;
}

static int accel_self_test(long *bias_regular, long *bias_st)
{
    int jj, result = 0;
    float st_shift[3], st_shift_cust, st_shift_var;

    get_accel_prod_shift(st_shift);
    for(jj = 0; jj < 3; jj++) {
        st_shift_cust = labs(bias_regular[jj] - bias_st[jj]) / 65536.f;
        if (st_shift[jj]) {
            st_shift_var = st_shift_cust / st_shift[jj] - 1.f;
            if (fabs(st_shift_var) > test.max_accel_var)
                result |= 1 << jj;
        } else if ((st_shift_cust < test.min_g) ||
            (st_shift_cust > test.max_g))
            result |= 1 << jj;
    }

    return result;
}

static int gyro_self_test(long *bias_regular, long *bias_st)
{
    int jj, result = 0;
    unsigned char tmp[3];
    float st_shift, st_shift_cust, st_shift_var;

    if (i2c_read(st.hw->addr, 0x0D, 3, tmp))
        return 0x07;

    tmp[0] &= 0x1F;
    tmp[1] &= 0x1F;
    tmp[2] &= 0x1F;

    for (jj = 0; jj < 3; jj++) {
        st_shift_cust = labs(bias_regular[jj] - bias_st[jj]) / 65536.f;
        if (tmp[jj]) {
            st_shift = 3275.f / test.gyro_sens;
            while (--tmp[jj])
                st_shift *= 1.046f;
            st_shift_var = st_shift_cust / st_shift - 1.f;
            if (fabs(st_shift_var) > test.max_gyro_var)
                result |= 1 << jj;
        } else if ((st_shift_cust < test.min_dps) ||
            (st_shift_cust > test.max_dps))
            result |= 1 << jj;
    }
    return result;
}

#endif 
#ifdef AK89xx_SECONDARY
static int compass_self_test(void)
{
//    unsigned char tmp[6];
//    unsigned char tries = 10;
//    int result = 0x07;
//    short data;
//	  unsigned char tiaoshi=0;
//    char test[20]={0};
// mpu_set_bypass(1); //  设置为直通模式
// //   mpu_set_bypass(0);   //应该为非直通模式
//	
//		printff(USART3, "11111111111!!!\r\n",strlen("11111111111!!!\r\n"));	   
//		
//	  MPU9250_Write_Reg(MPU_USER_CTRL_REG,0X20);  //I2C主模式开启
//	  MPU9250_Write_Reg(I2C_SLV0_CTRL,0x81);//Enable reading data from this slave at the sample rate && 1 Byte length
//		MPU9250_Write_Reg(I2C_MST_CTRL,0x0d);//I2C MAster mode and Speed 400 kHz
//		MPU9250_Write_Reg(I2C_MST_DELAY_CTRL ,0x01);//延时使能I2C_SLV0 _DLY_ enable 	
//  	MPU9250_Write_Reg(I2C_SLV0_CTRL ,0x81); //enable IIC	and EXT_SENS_DATA==1 Byte
//		
//    tmp[0] = AKM_POWER_DOWN;
//	 i2c_Mag_write(AKM_REG_CNTL,tmp[0]);
//	  tiaoshi = i2c_Mag_read(AKM_REG_WHOAMI);
//   sprintf( test, "%u", tiaoshi); 
//	 printff(USART3, test,strlen(test));	
////    if (i2c_write(st.chip_cfg.compass_addr, AKM_REG_CNTL, 1, tmp))
////        return 0x07;
//	  
//  	printff(USART3, "222222222222222222!!!\r\n",strlen("222222222222222222!!!\r\n"));	   		
//		
//    tmp[0] = AKM_BIT_SELF_TEST;
//	  i2c_Mag_write(AKM_REG_ASTC,tmp[0]);
////    if (i2c_write(st.chip_cfg.compass_addr, AKM_REG_ASTC, 1, tmp))
//	   //   goto AKM_restore;
//	
//    tmp[0] = AKM_MODE_SELF_TEST;
//	  i2c_Mag_write(AKM_REG_CNTL,tmp[0]);
// //   if (i2c_write(st.chip_cfg.compass_addr, AKM_REG_CNTL, 1, tmp))
//	 //    goto AKM_restore;
//	  
//		printff(USART3, "33333333333!!!\r\n",strlen("33333333333!!!\r\n"));	   		

//    do {
//        delay_ms(10);
//  //      if (i2c_read(st.chip_cfg.compass_addr, AKM_REG_ST1, 1, tmp))
//			       //     goto AKM_restore;
//			tmp[0] = i2c_Mag_read(AKM_REG_ST1);

//        if (tmp[0] & AKM_DATA_READY)
//            break;
//    } while (tries--);
//    if (!(tmp[0] & AKM_DATA_READY))
//		printff(USART3, "没准备好!!!\r\n",strlen("没准备好!!!\r\n"));	   
//   //     goto AKM_restore;

//		printff(USART3, "444444444444444444!!!\r\n",strlen("444444444444444444!!!\r\n"));	   		
//  //  if (i2c_read(st.chip_cfg.compass_addr, AKM_REG_HXL, 6, tmp))
//		tmp[0] = i2c_Mag_read(0x03);
//		tmp[1] = i2c_Mag_read(0x04);
//		tmp[2] = i2c_Mag_read(0x05);
//		tmp[3] = i2c_Mag_read(0x06);
//		tmp[4] = i2c_Mag_read(0x07);
//		tmp[5] = i2c_Mag_read(0x08);
//      //  goto AKM_restore;

//    result = 0;
//#if defined MPU9150
//    data = (short)(tmp[1] << 8) | tmp[0];
//    if ((data > 100) || (data < -100))
//        result |= 0x01;
//    data = (short)(tmp[3] << 8) | tmp[2];
//    if ((data > 100) || (data < -100))
//        result |= 0x02;
//    data = (short)(tmp[5] << 8) | tmp[4];
//    if ((data > -300) || (data < -1000))
//        result |= 0x04;
//#elif defined MPU9250
//    data = (short)(tmp[1] << 8) | tmp[0];
//    if ((data > 200) || (data < -200))  
//        result |= 0x01;
//    data = (short)(tmp[3] << 8) | tmp[2];
//    if ((data > 200) || (data < -200))  
//        result |= 0x02;
//    data = (short)(tmp[5] << 8) | tmp[4];
//    if ((data > -800) || (data < -3200))  
//        result |= 0x04;
//#endif
////AKM_restore:
////    tmp[0] = 0 | SUPPORTS_AK89xx_HIGH_SENS;
//// //   i2c_write(st.chip_cfg.compass_addr, AKM_REG_ASTC, 1, tmp);
////			i2c_Mag_write(AKM_REG_ASTC,tmp[0]);
////    tmp[0] = SUPPORTS_AK89xx_HIGH_SENS;
//// //   i2c_write(st.chip_cfg.compass_addr, AKM_REG_CNTL, 1, tmp);
////		i2c_Mag_write(AKM_REG_CNTL,tmp[0]);
////    mpu_set_bypass(0);
//    return result;
//AK8963_SelfTest();
return 0;
}
#endif

static int get_st_biases(long *gyro, long *accel, unsigned char hw_test)
{
    unsigned char data[MAX_PACKET_LENGTH];
    unsigned char packet_count, ii;
    unsigned short fifo_count;

    data[0] = 0x01;
    data[1] = 0;
    if (i2c_write(st.hw->addr, st.reg->pwr_mgmt_1, 2, data))
        return -1;
    delay_ms(200);
    data[0] = 0;
    if (i2c_write(st.hw->addr, st.reg->int_enable, 1, data))
        return -1;
    if (i2c_write(st.hw->addr, st.reg->fifo_en, 1, data))
        return -1;
    if (i2c_write(st.hw->addr, st.reg->pwr_mgmt_1, 1, data))
        return -1;
    if (i2c_write(st.hw->addr, st.reg->i2c_mst, 1, data))
        return -1;
    if (i2c_write(st.hw->addr, st.reg->user_ctrl, 1, data))
        return -1;
    data[0] = BIT_FIFO_RST | BIT_DMP_RST;
    if (i2c_write(st.hw->addr, st.reg->user_ctrl, 1, data))
        return -1;
    delay_ms(15);
    data[0] = st.test->reg_lpf;
    if (i2c_write(st.hw->addr, st.reg->lpf, 1, data))
        return -1;
    data[0] = st.test->reg_rate_div;
    if (i2c_write(st.hw->addr, st.reg->rate_div, 1, data))
        return -1;
    if (hw_test)
        data[0] = st.test->reg_gyro_fsr | 0xE0;
    else
        data[0] = st.test->reg_gyro_fsr;
    if (i2c_write(st.hw->addr, st.reg->gyro_cfg, 1, data))
        return -1;

    if (hw_test)
        data[0] = st.test->reg_accel_fsr | 0xE0;
    else
        data[0] = test.reg_accel_fsr;
    if (i2c_write(st.hw->addr, st.reg->accel_cfg, 1, data))
        return -1;
    if (hw_test)
        delay_ms(200);

    /* Fill FIFO for test.wait_ms milliseconds. */
    data[0] = BIT_FIFO_EN;
    if (i2c_write(st.hw->addr, st.reg->user_ctrl, 1, data))
        return -1;

    data[0] = INV_XYZ_GYRO | INV_XYZ_ACCEL;
    if (i2c_write(st.hw->addr, st.reg->fifo_en, 1, data))
        return -1;
    delay_ms(test.wait_ms);
    data[0] = 0;
    if (i2c_write(st.hw->addr, st.reg->fifo_en, 1, data))
        return -1;

    if (i2c_read(st.hw->addr, st.reg->fifo_count_h, 2, data))
        return -1;

    fifo_count = (data[0] << 8) | data[1];
    packet_count = fifo_count / MAX_PACKET_LENGTH;
    gyro[0] = gyro[1] = gyro[2] = 0;
    accel[0] = accel[1] = accel[2] = 0;

    for (ii = 0; ii < packet_count; ii++) {
        short accel_cur[3], gyro_cur[3];
        if (i2c_read(st.hw->addr, st.reg->fifo_r_w, MAX_PACKET_LENGTH, data))
            return -1;
        accel_cur[0] = ((short)data[0] << 8) | data[1];
        accel_cur[1] = ((short)data[2] << 8) | data[3];
        accel_cur[2] = ((short)data[4] << 8) | data[5];
        accel[0] += (long)accel_cur[0];
        accel[1] += (long)accel_cur[1];
        accel[2] += (long)accel_cur[2];
        gyro_cur[0] = (((short)data[6] << 8) | data[7]);
        gyro_cur[1] = (((short)data[8] << 8) | data[9]);
        gyro_cur[2] = (((short)data[10] << 8) | data[11]);
        gyro[0] += (long)gyro_cur[0];
        gyro[1] += (long)gyro_cur[1];
        gyro[2] += (long)gyro_cur[2];
    }
#ifdef EMPL_NO_64BIT
    gyro[0] = (long)(((float)gyro[0]*65536.f) / test.gyro_sens / packet_count);
    gyro[1] = (long)(((float)gyro[1]*65536.f) / test.gyro_sens / packet_count);
    gyro[2] = (long)(((float)gyro[2]*65536.f) / test.gyro_sens / packet_count);
    if (has_accel) {
        accel[0] = (long)(((float)accel[0]*65536.f) / test.accel_sens /
            packet_count);
        accel[1] = (long)(((float)accel[1]*65536.f) / test.accel_sens /
            packet_count);
        accel[2] = (long)(((float)accel[2]*65536.f) / test.accel_sens /
            packet_count);
        /* Don't remove gravity! */
        accel[2] -= 65536L;
    }
#else
    gyro[0] = (long)(((long long)gyro[0]<<16) / test.gyro_sens / packet_count);
    gyro[1] = (long)(((long long)gyro[1]<<16) / test.gyro_sens / packet_count);
    gyro[2] = (long)(((long long)gyro[2]<<16) / test.gyro_sens / packet_count);
    accel[0] = (long)(((long long)accel[0]<<16) / test.accel_sens /
        packet_count);
    accel[1] = (long)(((long long)accel[1]<<16) / test.accel_sens /
        packet_count);
    accel[2] = (long)(((long long)accel[2]<<16) / test.accel_sens /
        packet_count);
    /* Don't remove gravity! */
    if (accel[2] > 0L)
        accel[2] -= 65536L;
    else
        accel[2] += 65536L;
#endif

