WHeiu/Drone-control-project/无人机管控模块/程序/stm32_new_HAL_LL/Stm32_New-1.1.2/Src/MPU9250/invmpuu.c
    if (!firmware)
        return -1;
    for (ii = 0; ii < length; ii += this_write) {
        this_write = min(LOAD_CHUNK, length - ii);
        if (mpu_write_mem(ii, this_write, (unsigned char*)&firmware[ii]))
            return -1;
        if (mpu_read_mem(ii, this_write, cur))
            return -1;
        if (memcmp(firmware+ii, cur, this_write))
            return -2;
    }

    /* Set program start address. */
    tmp[0] = start_addr >> 8;
    tmp[1] = start_addr & 0xFF;
    if (i2c_write(st.hw->addr, st.reg->prgm_start_h, 2, tmp))
        return -1;

    st.chip_cfg.dmp_loaded = 1;
    st.chip_cfg.dmp_sample_rate = sample_rate;
    return 0;
}

/**
 *  @brief      Enable/disable DMP support.
 *  @param[in]  enable  1 to turn on the DMP.
 *  @return     0 if successful.
 */
int mpu_set_dmp_state(unsigned char enable)
{
    unsigned char tmp;
    if (st.chip_cfg.dmp_on == enable)
        return 0;

    if (enable) {
        if (!st.chip_cfg.dmp_loaded)
            return -1;
        /* Disable data ready interrupt. */
        set_int_enable(0);
        /* Disable bypass mode. */
        mpu_set_bypass(0);
        /* Keep constant sample rate, FIFO rate controlled by DMP. */
        mpu_set_sample_rate(st.chip_cfg.dmp_sample_rate);
        /* Remove FIFO elements. */
        tmp = 0;
        i2c_write(st.hw->addr, 0x23, 1, &tmp);
        st.chip_cfg.dmp_on = 1;
        /* Enable DMP interrupt. */
        set_int_enable(1);
        mpu_reset_fifo();
    } else {
        /* Disable DMP interrupt. */
        set_int_enable(0);
        /* Restore FIFO settings. */
        tmp = st.chip_cfg.fifo_enable;
        i2c_write(st.hw->addr, 0x23, 1, &tmp);
        st.chip_cfg.dmp_on = 0;
        mpu_reset_fifo();
    }
    return 0;
}

/**
 *  @brief      Get DMP state.
 *  @param[out] enabled 1 if enabled.
 *  @return     0 if successful.
 */
int mpu_get_dmp_state(unsigned char *enabled)
{
    enabled[0] = st.chip_cfg.dmp_on;
    return 0;
}

#ifdef AK89xx_SECONDARY
/* This initialization is similar to the one in ak8975.c. */
 int setup_compass(void)
{
    unsigned char data[4], akm_addr;
		char TEST10[20] = {0};
		char TEST11[20] = {0};
		char TEST12[20] = {0};
		uint8_t res;
		uint8_t dataa;
		uint8_t state;
//    mpu_set_bypass(1);	
	  printff(USART3, "****************setup_compass****************\r\n",strlen("****************setup_compass****************\r\n"));	   
//		MPU9250_Write_Reg(MPU_USER_CTRL_REG,0X20);  //I2C主模式开启  Isolate I2C for compass
//	  MPU9250_Write_Reg(I2C_MST_CTRL,0x0d);//I2C MAster mode and Speed 400 kHz
		MPU9250_SPI_Write(MPU9250_I2C_SLV4_CTRL, 0x09);
   	LL_mDelay(1);
	  //When enabled, slave 0 will only be accessed 1+I2C_MST_DLY) samples as determined by SMPLRT_DIV and DLPF_CFG
	  MPU9250_SPI_Write(MPU9250_I2C_MST_DELAY_CTRL, 0x81);
    LL_mDelay(100);
//    mpu_set_bypass(0);
//   	MPU9250_Write_Reg(MPU_USER_CTRL_REG,0X20);  //I2C主模式开启
//	  MPU9250_Write_Reg(I2C_SLV0_CTRL,0x81);//Enable reading data from this slave at the sample rate && 1 Byte length
 // 	MPU9250_Write_Reg(I2C_MST_CTRL,0x0d);//I2C MAster mode and Speed 400 kHz
//		MPU9250_Write_Reg(I2C_MST_DELAY_CTRL ,0x01);//延时使能I2C_SLV0 _DLY_ enable 	
//  	MPU9250_Write_Reg(I2C_SLV0_CTRL ,0x81); //enable IIC	and EXT_SENS_DATA==1 Byte
//	
    /* Find compass. Possible addresses range from 0x0C to 0x0F. */
//    for (akm_addr = 0x0C; akm_addr <= 0x0F; akm_addr++) {
////        int result;
//   //     result = i2c_read(akm_addr, AKM_REG_WHOAMI, 1, data);
//			data[0] = i2c_Mag_read1( akm_addr,AKM_REG_WHOAMI);
//        if (data[0] == AKM_WHOAMI)
//       break;
//				
//   }

//    if (akm_addr > 0x0F) {
//        /* TODO: Handle this case in all compass-related functions. */
//     //   log_e("Compass not found.\n");
//			printff(USART3, "Compass not found.!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\r\n",strlen("Compass not found.!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\r\n"));	   
//        return -1;
//    }

//    st.chip_cfg.compass_addr = akm_addr;

//    data[0] = AKM_POWER_DOWN;
////    if (i2c_write(st.chip_cfg.compass_addr, AKM_REG_CNTL, 1, data))
////        return -1;
//		i2c_Mag_write(AKM_REG_CNTL,data[0]);
//    delay_ms(1);

//    data[0] = AKM_FUSE_ROM_ACCESS;
////    if (i2c_write(st.chip_cfg.compass_addr, AKM_REG_CNTL, 1, data))
////        return -1;
//		i2c_Mag_write(AKM_REG_CNTL,data[0]);
//    delay_ms(1);

    /* Get sensitivity adjustment data from fuse ROM. */
//    if (i2c_read(st.chip_cfg.compass_addr, AKM_REG_ASAX, 3, data))
//        return -1;
//	dataa = MPU9250_SPI_Read(MPU9250_INT_PIN_CFG);    
//  LL_mDelay(1);
//	MPU9250_SPI_Write(MPU9250_INT_PIN_CFG, (0xfd & dataa));   // DISable Bypass模式
//	LL_mDelay(1);
	//Enable the I2C Master I/F module; pins ES_DA and ES_SCL are isolated from pins SDA/SDI and SCL/ SCLK.
		//MPU9250 Set SPI Mode
	state = MPU9250_SPI_Read(MPU9250_USER_CTRL);
	LL_mDelay(1);
	//Reset I2C Slave module and put the serial interface in SPI mode only. This bit auto clears after one clock cycle.
	MPU9250_SPI_Write(MPU9250_USER_CTRL, state | MPU9250_I2C_IF_DIS);
	LL_mDelay(1);
	state = MPU9250_SPI_Read(MPU9250_USER_CTRL);
	LL_mDelay(1);
	MPU9250_SPI_Write(MPU9250_USER_CTRL, state | MPU9250_I2C_MST_EN);
	LL_mDelay(1);
	MPU9250_AK8963_SPI_Write(MPU9250_AK8963_I2C_ADDR,AK8963_CNTL2_REG,AK8963_CNTL2_SRST); // Reset AK8963
  LL_mDelay(1);
	MPU9250_AK8963_SPI_Read(MPU9250_AK8963_I2C_ADDR,AK8963_CNTL1_REG,&res);
	LL_mDelay(2);
	printff(USART3, "等待磁力计复位\r\n",strlen("等待磁力计复位\r\n"));	 
  while(!(res == 0x00))
	{
		MPU9250_AK8963_SPI_Write(MPU9250_AK8963_I2C_ADDR,AK8963_CNTL2_REG,AK8963_CNTL2_SRST); // Reset AK8963
		LL_mDelay(2);
		MPU9250_AK8963_SPI_Read(MPU9250_AK8963_I2C_ADDR,AK8963_CNTL1_REG,&res);
		LL_mDelay(1);
	}
	printff(USART3, "磁力计复位成功\r\n",strlen("磁力计复位成功\r\n"));	 
	MPU9250_AK8963_SPI_Write(MPU9250_AK8963_I2C_ADDR, MPU9250_AK8963_CNTL, MPU9250_AK8963_POWER_DOWN);
	LL_mDelay(1);
	MPU9250_AK8963_SPI_Read(MPU9250_AK8963_I2C_ADDR,MPU9250_AK8963_CNTL,&res);
	LL_mDelay(1);
	printff(USART3, "等待磁力计POWER DOWN\r\n",strlen("等待磁力计POWER DOWN\r\n"));
	while( !(res == MPU9250_AK8963_POWER_DOWN))
	{
		MPU9250_AK8963_SPI_Write(MPU9250_AK8963_I2C_ADDR,AK8963_CNTL1_REG,MPU9250_AK8963_POWER_DOWN); 
		LL_mDelay(1);
	}
	printff(USART3, "设置磁力计POWER DOWN模式成功\r\n",strlen("设置磁力计POWER DOWN模式成功\r\n"));
	//Fuse ROM access mode
	MPU9250_AK8963_SPI_Write(MPU9250_AK8963_I2C_ADDR, MPU9250_AK8963_CNTL, MPU9250_AK8963_FUSE_ROM_ACCESS);  //每个轴的灵敏度调整数据存储在Fuse ROM中
	LL_mDelay(1);
	MPU9250_AK8963_SPI_Read(MPU9250_AK8963_I2C_ADDR,MPU9250_AK8963_CNTL,&res);//测试MPU9250_AK8963_SPI_Read
	LL_mDelay(1);
//  if (res == MPU9250_AK8963_FUSE_ROM_ACCESS)
//	printff(USART3, "设置磁力计FUSE ROM模式成功\r\n",strlen("设置磁力计FUSE ROM模式成功\r\n"));
//	else
	printff(USART3, "等待设置磁力计FUSE ROM模式\r\n",strlen("等待设置磁力计FUSE ROM模式\r\n"));
	while(!(res == MPU9250_AK8963_FUSE_ROM_ACCESS))
	{
		MPU9250_AK8963_SPI_Write(MPU9250_AK8963_I2C_ADDR, MPU9250_AK8963_CNTL2, MPU9250_AK8963_CNTL2_SRST);  //复位磁力计
  	LL_mDelay(2);
		//BIT: Output bit setting 4800uT
		// "1": 16-bit output 
		MPU9250_AK8963_SPI_Write(MPU9250_AK8963_I2C_ADDR, MPU9250_AK8963_CNTL, MPU9250_AK8963_POWER_DOWN);
		LL_mDelay(1);
		//Fuse ROM access mode
		MPU9250_AK8963_SPI_Write(MPU9250_AK8963_I2C_ADDR, MPU9250_AK8963_CNTL, MPU9250_AK8963_FUSE_ROM_ACCESS);  //每个轴的灵敏度调整数据存储在Fuse ROM中
		LL_mDelay(1);
		MPU9250_AK8963_SPI_Read(MPU9250_AK8963_I2C_ADDR,MPU9250_AK8963_CNTL,&res);//测试MPU9250_AK8963_SPI_Read
		LL_mDelay(1);
	}
	printff(USART3, "设置磁力计FUSE ROM模式成功\r\n",strlen("设置磁力计FUSE ROM模式成功\r\n"));
	MPU9250_AK8963_SPI_Read_LEN(MPU9250_AK8963_I2C_ADDR, MPU9250_AK8963_ASAX, 3, data);
	LL_mDelay(10);
//		data[0] = i2c_Mag_read(AKM_REG_ASAX);
//		data[1] = i2c_Mag_read(0x11);
//		data[2] = i2c_Mag_read(0x12);
		
		sprintf( TEST10, "%u", data[0]); 
  	sprintf( TEST11, "%u", data[1]); 
	  sprintf( TEST12, "%u", data[2]); 
	  printff(USART3, "setup_compass response:\r\n",strlen("setup_compass response:\r\n"));
		printff(USART3, TEST10,strlen(TEST10));   printff(USART3, "\t",strlen("\t"));
		printff(USART3, TEST11,strlen(TEST11));   printff(USART3, "\t",strlen("\t"));
		printff(USART3, TEST12,strlen(TEST12));   printff(USART3, "\t",strlen("\t"));
	  printff(USART3, "\r\n",strlen("\r\n"));
		
    st.chip_cfg.mag_sens_adj[0] = (long)data[0] + 128;
    st.chip_cfg.mag_sens_adj[1] = (long)data[1] + 128;
    st.chip_cfg.mag_sens_adj[2] = (long)data[2] + 128;

    data[0] = AKM_POWER_DOWN;
//    if (i2c_write(st.chip_cfg.compass_addr, AKM_REG_CNTL, 1, data))
//        return -1;
		MPU9250_AK8963_SPI_Write(MPU9250_AK8963_I2C_ADDR, MPU9250_AK8963_CNTL, MPU9250_AK8963_POWER_DOWN);
   	LL_mDelay(1);

//    mpu_set_bypass(0);

    /* Set up master mode, master clock, and ES bit. */
    data[0] = 0x40;
    if (i2c_write(st.hw->addr, st.reg->i2c_mst, 1, data))
        return -1;

    /* Slave 0 reads from AKM data registers. */
    data[0] = BIT_I2C_READ | st.chip_cfg.compass_addr;
    if (i2c_write(st.hw->addr, st.reg->s0_addr, 1, data))
        return -1;

    /* Compass reads start at this register. */
    data[0] = AKM_REG_ST1;
    if (i2c_write(st.hw->addr, st.reg->s0_reg, 1, data))
        return -1;

