WHeiu/Drone-control-project/无人机管控模块/程序/stm32_new_HAL_LL/Stm32_New-1.1.2/Src/MPU9250/invmpuu.c
        /* Enter full-power accel-only mode, no FIFO/DMP. */
        data[0] = 0;
        data[1] = 0;
        data[2] = BIT_STBY_XYZG;
        if (i2c_write(st.hw->addr, st.reg->user_ctrl, 3, data))
            goto lp_int_restore;

        /* Set motion threshold. */
        data[0] = thresh_hw;
        if (i2c_write(st.hw->addr, st.reg->motion_thr, 1, data))
            goto lp_int_restore;

        /* Set wake frequency. */
        if (lpa_freq == 1)
            data[0] = INV_LPA_1_25HZ;
        else if (lpa_freq == 2)
            data[0] = INV_LPA_2_5HZ;
        else if (lpa_freq <= 5)
            data[0] = INV_LPA_5HZ;
        else if (lpa_freq <= 10)
            data[0] = INV_LPA_10HZ;
        else if (lpa_freq <= 20)
            data[0] = INV_LPA_20HZ;
        else if (lpa_freq <= 40)
            data[0] = INV_LPA_40HZ;
        else if (lpa_freq <= 80)
            data[0] = INV_LPA_80HZ;
        else if (lpa_freq <= 160)
            data[0] = INV_LPA_160HZ;
        else if (lpa_freq <= 320)
            data[0] = INV_LPA_320HZ;
        else
            data[0] = INV_LPA_640HZ;
        if (i2c_write(st.hw->addr, st.reg->lp_accel_odr, 1, data))
            goto lp_int_restore;

        /* Enable motion interrupt (MPU6500 version). */
        data[0] = BITS_WOM_EN;
        if (i2c_write(st.hw->addr, st.reg->accel_intel, 1, data))
            goto lp_int_restore;

        /* Enable cycle mode. */
        data[0] = BIT_LPA_CYCLE;
        if (i2c_write(st.hw->addr, st.reg->pwr_mgmt_1, 1, data))
            goto lp_int_restore;

        /* Enable interrupt. */
        data[0] = BIT_MOT_INT_EN;
        if (i2c_write(st.hw->addr, st.reg->int_enable, 1, data))
            goto lp_int_restore;

        st.chip_cfg.int_motion_only = 1;
        return 0;
#endif
    } else {
        /* Don't "restore" the previous state if no state has been saved. */
        unsigned int ii;
        char *cache_ptr = (char*)&st.chip_cfg.cache;
        for (ii = 0; ii < sizeof(st.chip_cfg.cache); ii++) {
            if (cache_ptr[ii] != 0)
                goto lp_int_restore;
        }
        /* If we reach this point, motion interrupt mode hasn't been used yet. */
        return -1;
    }
lp_int_restore:
    /* Set to invalid values to ensure no I2C writes are skipped. */
    st.chip_cfg.gyro_fsr = 0xFF;
    st.chip_cfg.accel_fsr = 0xFF;
    st.chip_cfg.lpf = 0xFF;
    st.chip_cfg.sample_rate = 0xFFFF;
    st.chip_cfg.sensors = 0xFF;
    st.chip_cfg.fifo_enable = 0xFF;
    st.chip_cfg.clk_src = INV_CLK_PLL;
    mpu_set_sensors(st.chip_cfg.cache.sensors_on);
    mpu_set_gyro_fsr(st.chip_cfg.cache.gyro_fsr);
    mpu_set_accel_fsr(st.chip_cfg.cache.accel_fsr);
    mpu_set_lpf(st.chip_cfg.cache.lpf);
    mpu_set_sample_rate(st.chip_cfg.cache.sample_rate);
    mpu_configure_fifo(st.chip_cfg.cache.fifo_sensors);

    if (st.chip_cfg.cache.dmp_on)
        mpu_set_dmp_state(1);

#ifdef MPU6500
    /* Disable motion interrupt (MPU6500 version). */
    data[0] = 0;
    if (i2c_write(st.hw->addr, st.reg->accel_intel, 1, data))
        goto lp_int_restore;
#endif

    st.chip_cfg.int_motion_only = 0;
    return 0;
}

//////////////////////////////////////////////////////////////////////////////////
//添加的代码部分
//////////////////////////////////////////////////////////////////////////////////	  
//ALIENTEK STM32F746开发板
//MPU9250 DMP 驱动代码	   
//正点原子@ALIENTEK
//技术论坛:www.openedv.com
//创建日期:2015/12/30
//版本：V1.0 
//Copyright(C) 广州市星翼电子科技有限公司 2014-2024
//All rights reserved									  
////////////////////////////////////////////////////////////////////////////////// 

//q30，q16格式,long转float时的除数.
#define q30  1073741824.0f
#define q16  65536.0f

//陀螺仪方向设置
static signed char gyro_orientation[9] = { 1, 0, 0,
                                           0, 1, 0,
                                           0, 0, 1};
//磁力计方向设置
static signed char comp_orientation[9] = { 0, 1, 0,
                                           1, 0, 0,
                                           0, 0,-1};
//MPU9250自测试
//返回值:0,正常
//    其他,失败
uint8_t run_self_test(void)
{
	int result;
	//char test_packet[4] = {0};
	long gyro[3], accel[3]; 
	result = mpu_run_6500_self_test(gyro, accel,1);
	if (result == 0x7) 
	{
		/* Test passed. We can trust the gyro data here, so let's push it down
		* to the DMP.
		*/
        unsigned short accel_sens;
		float gyro_sens;

		mpu_get_gyro_sens(&gyro_sens);
		gyro[0] = (long)(gyro[0] * gyro_sens);
		gyro[1] = (long)(gyro[1] * gyro_sens);
		gyro[2] = (long)(gyro[2] * gyro_sens);
        //inv_set_gyro_bias(gyro, 3);
		dmp_set_gyro_bias(gyro);
		mpu_get_accel_sens(&accel_sens);
		accel[0] *= accel_sens;
		accel[1] *= accel_sens;
		accel[2] *= accel_sens;
       // inv_set_accel_bias(accel, 3);
		dmp_set_accel_bias(accel);
		return 0;
	}else return 1;
}

//方向转换
unsigned short inv_row_2_scale(const signed char *row)
{
    unsigned short b;

    if (row[0] > 0)
        b = 0;
    else if (row[0] < 0)
        b = 4;
    else if (row[1] > 0)
        b = 1;
    else if (row[1] < 0)
        b = 5;
    else if (row[2] > 0)
        b = 2;
    else if (row[2] < 0)
        b = 6;
    else
        b = 7;      // error
    return b;
}
//空函数,未用到.
void mget_ms(unsigned long *time)
{
    //*time=(unsigned long)HAL_GetTick();
}
//mpu6050,dmp初始化
//返回值:0,正常
//    其他,失败
uint8_t mpu_dmp_init(void)
{
	uint8_t res=0;
	struct int_param_s int_param;
	unsigned char accel_fsr;
	unsigned short gyro_rate, gyro_fsr;
	unsigned short compass_fsr;
  char test[10]={0};
	//IIC_Init(); 		        //初始化IIC总线
	if(mpu_init(&int_param)==0)	//初始化MPU9250
	{	 
    printff(USART3, "5555555555555!!!\r\n",strlen("5555555555555!!!\r\n"));	   
        res=inv_init_mpl();     //初始化MPL
				printff(USART3, "66666666666666!!!\r\n",strlen("66666666666666!!!\r\n"));	   
        if(res)return 1;
      	printff(USART3, "77777777777777!!!\r\n",strlen("77777777777777!!!\r\n"));	   
        inv_enable_quaternion();
        inv_enable_9x_sensor_fusion();
        inv_enable_fast_nomot();
        inv_enable_gyro_tc();
        inv_enable_vector_compass_cal();
        inv_enable_magnetic_disturbance();
        inv_enable_eMPL_outputs();
		
				res=inv_start_mpl();    //开启MPL
				printff(USART3, "8888888888888888!!!\r\n",strlen("8888888888888888!!!\r\n"));	   
				if(res)return 1;
				printff(USART3, "99999999999!!!\r\n",strlen("99999999999!!!\r\n"));	 
				res=mpu_set_sensors(INV_XYZ_GYRO|INV_XYZ_ACCEL|INV_XYZ_COMPASS);//设置所需要的传感器
				if(res)return 2; 
				printff(USART3, "aaaaaaaaaaaa!!!\r\n",strlen("aaaaaaaaaaaa!!!\r\n"));	 
				res=mpu_configure_fifo(INV_XYZ_GYRO | INV_XYZ_ACCEL);   //设置FIFO
				if(res)return 3; 
				printff(USART3, "bbbbbbbbbbbbbbb!!!\r\n",strlen("bbbbbbbbbbbbbbb!!!\r\n"));	 
				res=mpu_set_sample_rate(DEFAULT_MPU_HZ);	            //设置采样率
			 if(res)return 4; 
		  	printff(USART3, "cccccccccccccc!!!\r\n",strlen("cccccccccccccc!!!\r\n"));	 
        res=mpu_set_compass_sample_rate(1000/COMPASS_READ_MS);  //设置磁力计采样率
        if(res)return 5;
			  printff(USART3, "dddddddddddddddd!!!\r\n",strlen("dddddddddddddddd!!!\r\n"));	 	
        mpu_get_sample_rate(&gyro_rate);
        mpu_get_gyro_fsr(&gyro_fsr);
        mpu_get_accel_fsr(&accel_fsr);
        mpu_get_compass_fsr(&compass_fsr);
        inv_set_gyro_sample_rate(1000000L/gyro_rate);
        inv_set_accel_sample_rate(1000000L/gyro_rate);
								
        inv_set_compass_sample_rate(COMPASS_READ_MS*1000L);
        inv_set_gyro_orientation_and_scale(
            inv_orientation_matrix_to_scalar(gyro_orientation),(long)gyro_fsr<<15);
						 
        inv_set_accel_orientation_and_scale(
            inv_orientation_matrix_to_scalar(gyro_orientation),(long)accel_fsr<<15);

        inv_set_compass_orientation_and_scale(
            inv_orientation_matrix_to_scalar(comp_orientation),(long)compass_fsr<<15);
            
    printff(USART3, "eeeeeeeeeeee!!!\r\n",strlen("eeeeeeeeeeee!!!\r\n"));	 
		res=dmp_load_motion_driver_firmware();		             //加载dmp固件
		printff(USART3, "fffffffffffffffffffffff!!!\r\n",strlen("fffffffffffffffffffffff!!!\r\n"));	 	
		if(res)return 6; 
	  printff(USART3, "gggggggggggggggggggg!!!\r\n",strlen("gggggggggggggggggggg!!!\r\n"));	
		res=dmp_set_orientation(inv_orientation_matrix_to_scalar(gyro_orientation));//设置陀螺仪方向
		if(res)return 7; 
			
		res=dmp_enable_feature(DMP_FEATURE_6X_LP_QUAT|DMP_FEATURE_TAP|	            //设置dmp功能
		DMP_FEATURE_ANDROID_ORIENT|DMP_FEATURE_SEND_RAW_ACCEL|DMP_FEATURE_SEND_CAL_GYRO|
		DMP_FEATURE_GYRO_CAL);
		if(res)return 8; 
		 	
		res=dmp_set_fifo_rate(DEFAULT_MPU_HZ);	//设置DMP输出速率(最大不超过200Hz)
		if(res)return 9;   
		printff(USART3, "hhhhhhhhhhhhhh!!!\r\n",strlen("hhhhhhhhhhhhhh!!!\r\n"));	 	
		res=run_self_test();		//自检
		
   sprintf( test, "%u", res); 
	 printff(USART3, test,strlen(test));	 	
	 		printff(USART3, "\r\n",strlen("\r\n"));
		if(res)
		{
			printff(USART3, "run_self_test error!!!\r\n",strlen("run_self_test error!!!\r\n"));	 	
			return 10;
		}			
	  printff(USART3, "iiiiiiiiiiiiii!!!\r\n",strlen("iiiiiiiiiiiiii!!!\r\n"));	 
		res=mpu_set_dmp_state(1);	//使能DMP
		if(res)return 11;     
		printff(USART3, "jjjjjjjjjjjjjjj!!!\r\n",strlen("jjjjjjjjjjjjjjj!!!\r\n"));	 
		
